Revit 2027 API
AnnotationMultipleAlignmentUtils.GetAnnotationOutlineWithoutLeaders Method
 Gets the four corners of the alignable element in model space without its leaders.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<XYZ> GetAnnotationOutlineWithoutLeaders(
	Element element
)
Public Shared Function GetAnnotationOutlineWithoutLeaders (
	element As Element
) As IList(Of XYZ)
public:
static IList<XYZ^>^ GetAnnotationOutlineWithoutLeaders(
	Element^ element
)
static member GetAnnotationOutlineWithoutLeaders :
        element : Element -> IList<XYZ>
Parameters
element Element
 The element for which we are retrieving the outline corners.
Return Value
IList<XYZ>
 The array of the four corner points for the alignable element.
Exceptions
Exception | Condition
ArgumentException |  The element element does not support multiple alignment behavior. -or-
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AnnotationMultipleAlignmentUtils Class
Autodesk.Revit.DB Namespace